project/Egypt/webservice interface20180517/image update/req_UploadFile.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header>
      <ResourceURI xmlns="http://www.energiened.nl/Content/Publications/dsmr/P32">http://www.energiened.nl/Content/Publications/dsmr/P32/ metersDirectory</ResourceURI>
   </S:Header>
   <S:Body>
      <ns3:Create xmlns:ns5="http://www.energiened.nl/Content/Publications/dsmr/P32" xmlns:ns4="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:ns3="http://schemas.xmlsoap.org/ws/2006/08/resourceTransfer" xmlns:ns2="http://www.w3.org/2005/08/addressing" xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">

         <ns3:Fragment>
            <ns3:Expression>p32:UpgradeAccess</ns3:Expression>
            <ns3:Value>
               <ns5:UploadFile> 
               	<ns5:Type>DCU</ns5:Type>  <!--Type value can be DCU, MMod, SMod, Meter-->
               	<ns5:Password>000000</ns5:Password>
               	<ns5:FileName>as_L019-16U02.01_2015-02-15.zip</ns5:FileName>
               	<ns5:FrameNo>1</ns5:FrameNo>  <!--1,2,3,...-->
               	<ns5:LastFrame>false</ns5:LastFrame>
               	<ns5:Data>400223</ns5:Data>   <!--FrameSize*2 length HEX characters(0-9,A-f,a-f),2 character compsite a byte of file-->
               </ns5:UploadFile>
            </ns3:Value>
         </ns3:Fragment>
      </ns3:Create>
   </S:Body>
</S:Envelope>